function aimvalue = transportmodel( c,k )
%   K1,K2,K3为权重系数;m1为每个员工工资;m2为单位路程运费;
%   mu为楼下等待时顾客下来概率强度;
%   各区域运输距离列向量L(n行);各时间段时间长度行向量T(m列)
%   配送人员分布矩阵c(n行:n个区域,m列:m个时间段);泊松概率强度lamda(n行m列)
%   矩阵x(n行,2m列)
simulations=100000;  %仿真次数
%[n,m]=size(x);
%m=m/2;
%c=x(1:n,1:m);
%k=x(1:n,m+1:2*m);
[n,m]=size(c);
%数据录入
mu=0.5;
lamda=[0.707 2.04715 1.13365 0.53585 1.03915 1.1655 0.5957;
     0.909 2.63205 1.45755 0.68895 1.33605 1.4985 0.7659;
     1.01 2.9245 1.6195 0.7655 1.4845 1.665 0.851;
     1.01 2.9245 1.6195 0.7655 1.4845 1.665 0.851;
     0.505 1.46225 0.80975  0.38275 0.74225 0.8325 0.4255;
     0.505 1.46225 0.80975  0.38275 0.74225 0.8325 0.4255;
     0.404 1.1698 0.6478 0.3062 0.5938 0.666 0.3404
     ];   %第i行j列表示第i个区域第j个时间段订单到达概率强度  
L=[1000;780;280;180;600;890;760];       %第i行表示第i个区域单次运送距离
transporttime=[10/3;2.6;2.8/3;0.6;2;8.9/3;7.6/3];
T=[120,120,120,120,120,120,120];
m1=1;m2=1;K1=0.45/100;K2=0.1/6192;K3=0.45/8;          %权重设置  找出最大值,归一化后K1=0.45,K2=0.1,K3=0.45;
totaldistance=0;
totalwaittime=0;
for i=1:n
    for j=1:m
        totaldistance=totaldistance+2*L(i,1)*T(1,j)*lamda(i,j)/k(i,j);
        totalwaittime=totalwaittime+T(1,j)*lamda(i,j)*waimai(simulations,lamda(i,j),c(i,j),k(i,j),transporttime(i,1),mu);
    end
end
aimvalue=K1*m1*norm(c,1)+K2*m2*totaldistance+K3*totalwaittime; %归一化
end

